[Timeout] StringLiteral
src/main/components/OurTable.js:16:60
   "whiteSpace": "nowrap"
 };
 // Stryker restore all
-export default function OurTable({ columns, data, testid = "testid", ...rest }) {
+export default function OurTable({ columns, data, testid = "", ...rest }) {
 
   const {

[Timeout] ObjectLiteral
src/main/components/OurTable.js:24:16
     headerGroups,
     rows,
     prepareRow,
-  } = useTable({
-    columns,
-    data,
-    ...(rest.initialState && {
-      initialState: rest.initialState
-    })
-  }, useSortBy)
+  } = useTable({}, useSortBy)
 
   return (
