[Killed] ObjectLiteral
src/main/pages/LeaderboardPage.js:63:20
     return (
         <div
             data-testid={"LeaderboardPage-main-div"}
-            style={{
-                backgroundSize: "cover",
-                backgroundImage: `url(${Background})`,
-                width: '100%', 
-                minHeight: '100vh', 
-            }}
+            style={{}}
         >
             <BasicLayout>
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: Error: expect(element).toHaveAttribute("style", "background-size: cover; background-image: url(PlayPageBackground.png); width: 100%; min-height: 100vh;") // element.getAttribute("style") === "background-size: cover; background-image: url(PlayPageBackground.png); width: 100%; min-height: 100vh;"

Expected the element to have attribute:
  style="background-size: cover; background-image: url(PlayPage

[Killed] StringLiteral
src/main/pages/LeaderboardPage.js:67:28
                 backgroundSize: "cover",
                 backgroundImage: `url(${Background})`,
                 width: '100%', 
-                minHeight: '100vh', 
+                minHeight: "", 
             }}
         >
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: Error: expect(element).toHaveAttribute("style", "background-size: cover; background-image: url(PlayPageBackground.png); width: 100%; min-height: 100vh;") // element.getAttribute("style") === "background-size: cover; background-image: url(PlayPageBackground.png); width: 100%; min-height: 100vh;"

Expected the element to have attribute:
  style="background-size: cover; background-image: url(PlayPage

[Killed] StringLiteral
src/main/pages/LeaderboardPage.js:72:39
         >
             <BasicLayout>
                 <div 
-                    style={{ display: 'flex', justifyContent: 'center', alignItems: 'center', flexDirection: 'column', width: '100%' }}
+                    style={{ display: "", justifyContent: 'center', alignItems: 'center', flexDirection: 'column', width: '100%' }}
                     data-testid="LeaderboardPage-layout-div" 
                 >
killedBy: LeaderboardPage tests div elements have correct styles applied
statusReason: Error: expect(element).toHaveStyle()

- Expected

- alignItems: center;
- display: flex;
- flexDirection: column;
- justifyContent: center;

[Killed] StringLiteral
src/main/pages/LeaderboardPage.js:76:149
                     data-testid="LeaderboardPage-layout-div" 
                 >
                     <div 
-                        style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center', width: '100%', maxWidth: '1200px', margin: '0 auto' }}
+                        style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center', width: '100%', maxWidth: '1200px', margin: "" }}
                         data-testid="LeaderboardPage-header-div" 
                     >
killedBy: LeaderboardPage tests div elements have correct styles applied
statusReason: Error: expect(element).toHaveStyle()

- Expected

- alignItems: center;
  display: flex;
- justifyContent: space-between;
- margin: 0px auto;

[Killed] StringLiteral
src/main/pages/LeaderboardPage.js:88:92
                         </Button>
                     </div>
                     {showLeaderboard ? (
-                        <div data-testid="LeaderboardPage-leaderboard-div" style={{ width: '100%', margin: '0 auto' }}>
+                        <div data-testid="LeaderboardPage-leaderboard-div" style={{ width: "", margin: '0 auto' }}>
                             <LeaderboardTable
                                 leaderboardUsers={userCommons}
killedBy: LeaderboardPage tests renders correct style for leaderboard for users when showLeaderboard = true
statusReason: Error: expect(element).toHaveStyle()

- Expected

  margin: 0px auto;
- width: 100%;

[Killed] StringLiteral
src/main/pages/LeaderboardPage.js:88:108
                         </Button>
                     </div>
                     {showLeaderboard ? (
-                        <div data-testid="LeaderboardPage-leaderboard-div" style={{ width: '100%', margin: '0 auto' }}>
+                        <div data-testid="LeaderboardPage-leaderboard-div" style={{ width: '100%', margin: "" }}>
                             <LeaderboardTable
                                 leaderboardUsers={userCommons}
killedBy: LeaderboardPage tests renders correct style for leaderboard for users when showLeaderboard = true
statusReason: Error: expect(element).toHaveStyle()

- Expected

- margin: 0px auto;
  width: 100%;
