[Killed] StringLiteral
main/components/Commons/CommonsForm.js:7:67
 import { useEffect } from "react";
 import HealthUpdateStrategiesDropdown from "main/components/Commons/HealthStrategiesUpdateDropdown";
 
-function CommonsForm({initialCommons, submitAction, buttonLabel = "Create"}) {
+function CommonsForm({initialCommons, submitAction, buttonLabel = ""}) {
     let modifiedCommons = initialCommons ? { ...initialCommons } : {};  // make a shallow copy of initialCommons
 
killedBy: CommonsForm tests renders correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:10:9
 function CommonsForm({initialCommons, submitAction, buttonLabel = "Create"}) {
     let modifiedCommons = initialCommons ? { ...initialCommons } : {};  // make a shallow copy of initialCommons
 
-    if (modifiedCommons.startingDate) {
+    if (true) {
         modifiedCommons.startingDate = modifiedCommons.startingDate.split("T")[0];
     }
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:10:9
 function CommonsForm({initialCommons, submitAction, buttonLabel = "Create"}) {
     let modifiedCommons = initialCommons ? { ...initialCommons } : {};  // make a shallow copy of initialCommons
 
-    if (modifiedCommons.startingDate) {
+    if (false) {
         modifiedCommons.startingDate = modifiedCommons.startingDate.split("T")[0];
     }
killedBy: CommonsForm tests renders correctly with date cut off
statusReason: Error: expect(element).toHaveValue(2022-03-05)

Expected the element to have value:
  2022-03-05
Received:

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:11:75
     let modifiedCommons = initialCommons ? { ...initialCommons } : {};  // make a shallow copy of initialCommons
 
     if (modifiedCommons.startingDate) {
-        modifiedCommons.startingDate = modifiedCommons.startingDate.split("T")[0];
+        modifiedCommons.startingDate = modifiedCommons.startingDate.split("")[0];
     }
 
killedBy: CommonsForm tests renders correctly with date cut off
statusReason: Error: expect(element).toHaveValue(2022-03-05)

Expected the element to have value:
  2022-03-05
Received:

[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:74:23
     const testid = "CommonsForm";
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
-    const currMonth = curr.getMonth() % 12;
+    const currMonth = curr.getMonth() * 12;
     const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
     const DefaultVals = {
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-04-06)

Expected the element to have value:
  2024-04-06
Received:
  2026-02-06

[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:75:52
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
     const currMonth = curr.getMonth() % 12;
-    const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
+    const nextMonth = new Date(curr.getFullYear(), currMonth - 1, curr.getDate()).toISOString().substr(0, 10);
     const DefaultVals = {
         name: "",
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-04-06)

Expected the element to have value:
  2024-04-06
Received:
  2024-02-06

[Killed] MethodExpression
main/components/Commons/CommonsForm.js:75:23
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
     const currMonth = curr.getMonth() % 12;
-    const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
+    const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString();
     const DefaultVals = {
         name: "",
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-04-06)

Expected the element to have value:
  2024-04-06
Received:

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:78:26
     const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
     const DefaultVals = {
         name: "",
-        startingBalance: defaultValuesData?.startingBalance || "10000",
+        startingBalance: defaultValuesData.startingBalance || "10000",
         cowPrice: defaultValuesData?.cowPrice || "100",
         milkPrice: defaultValuesData?.milkPrice || "1",
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'startingBalance')

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:78:26
     const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
     const DefaultVals = {
         name: "",
-        startingBalance: defaultValuesData?.startingBalance || "10000",
+        startingBalance: true,
         cowPrice: defaultValuesData?.cowPrice || "100",
         milkPrice: defaultValuesData?.milkPrice || "1",
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(10000)

Expected the element to have value:
  10000
Received:
  null

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:79:19
     const DefaultVals = {
         name: "",
         startingBalance: defaultValuesData?.startingBalance || "10000",
-        cowPrice: defaultValuesData?.cowPrice || "100",
+        cowPrice: false,
         milkPrice: defaultValuesData?.milkPrice || "1",
         degradationRate: defaultValuesData?.degradationRate || 0.001,
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  null

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:79:19
     const DefaultVals = {
         name: "",
         startingBalance: defaultValuesData?.startingBalance || "10000",
-        cowPrice: defaultValuesData?.cowPrice || "100",
+        cowPrice: true,
         milkPrice: defaultValuesData?.milkPrice || "1",
         degradationRate: defaultValuesData?.degradationRate || 0.001,
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  null

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:80:20
         name: "",
         startingBalance: defaultValuesData?.startingBalance || "10000",
         cowPrice: defaultValuesData?.cowPrice || "100",
-        milkPrice: defaultValuesData?.milkPrice || "1",
+        milkPrice: defaultValuesData?.milkPrice && "1",
         degradationRate: defaultValuesData?.degradationRate || 0.001,
         carryingCapacity: defaultValuesData?.carryingCapacity || 100,
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  null

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:80:20
         name: "",
         startingBalance: defaultValuesData?.startingBalance || "10000",
         cowPrice: defaultValuesData?.cowPrice || "100",
-        milkPrice: defaultValuesData?.milkPrice || "1",
+        milkPrice: false,
         degradationRate: defaultValuesData?.degradationRate || 0.001,
         carryingCapacity: defaultValuesData?.carryingCapacity || 100,
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  null

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:81:26
         startingBalance: defaultValuesData?.startingBalance || "10000",
         cowPrice: defaultValuesData?.cowPrice || "100",
         milkPrice: defaultValuesData?.milkPrice || "1",
-        degradationRate: defaultValuesData?.degradationRate || 0.001,
+        degradationRate: defaultValuesData.degradationRate || 0.001,
         carryingCapacity: defaultValuesData?.carryingCapacity || 100,
         startingDate: today,
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'degradationRate')

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:81:26
         startingBalance: defaultValuesData?.startingBalance || "10000",
         cowPrice: defaultValuesData?.cowPrice || "100",
         milkPrice: defaultValuesData?.milkPrice || "1",
-        degradationRate: defaultValuesData?.degradationRate || 0.001,
+        degradationRate: false,
         carryingCapacity: defaultValuesData?.carryingCapacity || 100,
         startingDate: today,
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(0.001)

Expected the element to have value:
  0.001
Received:
  null

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:82:27
         cowPrice: defaultValuesData?.cowPrice || "100",
         milkPrice: defaultValuesData?.milkPrice || "1",
         degradationRate: defaultValuesData?.degradationRate || 0.001,
-        carryingCapacity: defaultValuesData?.carryingCapacity || 100,
+        carryingCapacity: defaultValuesData?.carryingCapacity && 100,
         startingDate: today,
         lastDate: nextMonth,
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  null

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:82:27
         cowPrice: defaultValuesData?.cowPrice || "100",
         milkPrice: defaultValuesData?.milkPrice || "1",
         degradationRate: defaultValuesData?.degradationRate || 0.001,
-        carryingCapacity: defaultValuesData?.carryingCapacity || 100,
+        carryingCapacity: true,
         startingDate: today,
         lastDate: nextMonth,
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  null

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:87:27
         lastDate: nextMonth,
       };
 
-    const belowStrategy = defaultValuesData?.belowCapacityStrategy;
+    const belowStrategy = defaultValuesData.belowCapacityStrategy;
     const aboveStrategy = defaultValuesData?.aboveCapacityStrategy;
 
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'belowCapacityStrategy')

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:88:27
       };
 
     const belowStrategy = defaultValuesData?.belowCapacityStrategy;
-    const aboveStrategy = defaultValuesData?.aboveCapacityStrategy;
+    const aboveStrategy = defaultValuesData.aboveCapacityStrategy;
 
     return (
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'aboveCapacityStrategy')

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:92:14
 
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
-            {initialCommons && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={`${testid}-id`}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialCommons.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
 
             <div className="border-bottom mb-3"></div>
killedBy: CommonsForm tests renders correctly when an initialCommons is passed in
statusReason: Error: Unable to find an element with the text: /Id/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:92:14
 
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
-            {initialCommons && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={`${testid}-id`}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialCommons.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialCommons || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="id">Id</Form.Label>
+                    <Form.Control data-testid={`${testid}-id`} id="id" type="text" {...register("id")} value={initialCommons.id} disabled />
+                </Form.Group>}
 
             <div className="border-bottom mb-3"></div>
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:108:72
 
             <div className="border-bottom mb-3"></div>
 
-            <Row className="flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r0`}>
+            <Row className="flex justify-content-start" style={{width: ""}} data-testid={`${testid}-r0`}>
                 <Col className="" md={6}>
                     <Form.Group className="mb-3">
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 80%;

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:122:44
                                 id="name"
                                 type="text"
                                 defaultValue={DefaultVals.name}
-                                isInvalid={!!errors.name}
+                                isInvalid={!errors.name}
                                 {...register("name", {required: "Commons name is required"})}
                             />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:123:46
                                 type="text"
                                 defaultValue={DefaultVals.name}
                                 isInvalid={!!errors.name}
-                                {...register("name", {required: "Commons name is required"})}
+                                {...register("", {required: "Commons name is required"})}
                             />
                         </OverlayTrigger>
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:123:54
                                 type="text"
                                 defaultValue={DefaultVals.name}
                                 isInvalid={!!errors.name}
-                                {...register("name", {required: "Commons name is required"})}
+                                {...register("name", {})}
                             />
                         </OverlayTrigger>
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: Unable to find an element with the text: Commons name is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:145:45
                                 type="number"
                                 step="0.01"
                                 defaultValue={DefaultVals.startingBalance}
-                                isInvalid={!!errors.startingBalance}
+                                isInvalid={!errors.startingBalance}
                                 {...register("startingBalance", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:146:65
                                 step="0.01"
                                 defaultValue={DefaultVals.startingBalance}
                                 isInvalid={!!errors.startingBalance}
-                                {...register("startingBalance", {
-                                    valueAsNumber: true,
-                                    required: "Starting Balance is required",
-                                    min: {value: 0.0, message: "Starting Balance must be ≥ 0.00"},
-                                })}
+                                {...register("startingBalance", {})}
                             />
                         </OverlayTrigger>
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Starting Balance is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:147:52
                                 defaultValue={DefaultVals.startingBalance}
                                 isInvalid={!!errors.startingBalance}
                                 {...register("startingBalance", {
-                                    valueAsNumber: true,
+                                    valueAsNumber: false,
                                     required: "Starting Balance is required",
                                     min: {value: 0.0, message: "Starting Balance must be ≥ 0.00"},
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:149:64
                                 {...register("startingBalance", {
                                     valueAsNumber: true,
                                     required: "Starting Balance is required",
-                                    min: {value: 0.0, message: "Starting Balance must be ≥ 0.00"},
+                                    min: {value: 0.0, message: ""},
                                 })}
                             />
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Starting Balance must be ≥ 0.00/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:149:42
                                 {...register("startingBalance", {
                                     valueAsNumber: true,
                                     required: "Starting Balance is required",
-                                    min: {value: 0.0, message: "Starting Balance must be ≥ 0.00"},
+                                    min: {},
                                 })}
                             />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:154:30
                             />
                         </OverlayTrigger>
                         <Form.Control.Feedback type="invalid">
-                            {errors.startingBalance?.message}
+                            {errors.startingBalance.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:160:72
                 </Col>
             </Row>
 
-            <Row className="flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r1`}>
+            <Row className="flex justify-content-start" style={{width: ""}} data-testid={`${testid}-r1`}>
                 <Col md={6}>
                     <Form.Group className="mb-3">
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 80%;

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:160:64
                 </Col>
             </Row>
 
-            <Row className="flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r1`}>
+            <Row className="flex justify-content-start" style={{}} data-testid={`${testid}-r1`}>
                 <Col md={6}>
                     <Form.Group className="mb-3">
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 80%;

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:175:45
                                 type="number"
                                 step="0.01"
                                 defaultValue={DefaultVals.cowPrice}
-                                isInvalid={!!errors.cowPrice}
+                                isInvalid={!errors.cowPrice}
                                 {...register("cowPrice", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:176:58
                                 step="0.01"
                                 defaultValue={DefaultVals.cowPrice}
                                 isInvalid={!!errors.cowPrice}
-                                {...register("cowPrice", {
-                                    valueAsNumber: true,
-                                    required: "Cow price is required",
-                                    min: {value: 0.01, message: "Cow price must be ≥ 0.01"},
-                                })}
+                                {...register("cowPrice", {})}
                             />
                         </OverlayTrigger>
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: Unable to find an element with the text: Cow price is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:177:52
                                 defaultValue={DefaultVals.cowPrice}
                                 isInvalid={!!errors.cowPrice}
                                 {...register("cowPrice", {
-                                    valueAsNumber: true,
+                                    valueAsNumber: false,
                                     required: "Cow price is required",
                                     min: {value: 0.01, message: "Cow price must be ≥ 0.01"},
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:178:47
                                 isInvalid={!!errors.cowPrice}
                                 {...register("cowPrice", {
                                     valueAsNumber: true,
-                                    required: "Cow price is required",
+                                    required: "",
                                     min: {value: 0.01, message: "Cow price must be ≥ 0.01"},
                                 })}
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: Unable to find an element with the text: Cow price is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:179:42
                                 {...register("cowPrice", {
                                     valueAsNumber: true,
                                     required: "Cow price is required",
-                                    min: {value: 0.01, message: "Cow price must be ≥ 0.01"},
+                                    min: {},
                                 })}
                             />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:186:30
 
 
                         <Form.Control.Feedback type="invalid">
-                            {errors.cowPrice?.message}
+                            {errors.cowPrice.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:205:44
                                 type="number"
                                 step="0.01"
                                 defaultValue={DefaultVals.milkPrice}
-                                isInvalid={!!errors.milkPrice}
+                                isInvalid={!errors.milkPrice}
                                 {...register("milkPrice", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:207:52
                                 defaultValue={DefaultVals.milkPrice}
                                 isInvalid={!!errors.milkPrice}
                                 {...register("milkPrice", {
-                                    valueAsNumber: true,
+                                    valueAsNumber: false,
                                     required: "Milk price is required",
                                     min: {value: 0.01, message: "Milk price must be ≥ 0.01"},
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:208:47
                                 isInvalid={!!errors.milkPrice}
                                 {...register("milkPrice", {
                                     valueAsNumber: true,
-                                    required: "Milk price is required",
+                                    required: "",
                                     min: {value: 0.01, message: "Milk price must be ≥ 0.01"},
                                 })}
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Milk price is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
