[Killed] StringLiteral
main/components/Commons/CommonsForm.js:209:65
                                 {...register("milkPrice", {
                                     valueAsNumber: true,
                                     required: "Milk price is required",
-                                    min: {value: 0.01, message: "Milk price must be ≥ 0.01"},
+                                    min: {value: 0.01, message: ""},
                                 })}
                             />
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Milk price must be ≥ 0.01/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:214:30
                             />
                         </OverlayTrigger>
                         <Form.Control.Feedback type="invalid">
-                            {errors.milkPrice?.message}
+                            {errors.milkPrice.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:222:69
             </Row>
 
 
-            <Row className="mt-1 flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r2`}>
+            <Row className="mt-1 flex justify-content-start" style={{}} data-testid={`${testid}-r2`}>
                 <Col md={4}>
                     <Form.Group className="mb-3">
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 80%;

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:238:40
                             step="0.0001"
                             defaultValue={DefaultVals.degradationRate}
 
-                            isInvalid={!!errors.degradationRate}
+                            isInvalid={!errors.degradationRate}
                             {...register("degradationRate", {
                                 valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:239:61
                             defaultValue={DefaultVals.degradationRate}
 
                             isInvalid={!!errors.degradationRate}
-                            {...register("degradationRate", {
-                                valueAsNumber: true,
-                                required: "Degradation rate is required",
-                                min: {value: 0, message: "Degradation rate must be ≥ 0"},
-                            })}
+                            {...register("degradationRate", {})}
                         />
                         </OverlayTrigger>
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Degradation rate is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:240:48
 
                             isInvalid={!!errors.degradationRate}
                             {...register("degradationRate", {
-                                valueAsNumber: true,
+                                valueAsNumber: false,
                                 required: "Degradation rate is required",
                                 min: {value: 0, message: "Degradation rate must be ≥ 0"},
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:241:43
                             isInvalid={!!errors.degradationRate}
                             {...register("degradationRate", {
                                 valueAsNumber: true,
-                                required: "Degradation rate is required",
+                                required: "",
                                 min: {value: 0, message: "Degradation rate must be ≥ 0"},
                             })}
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Degradation rate is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:247:30
                         />
                         </OverlayTrigger>
                         <Form.Control.Feedback type="invalid">
-                            {errors.degradationRate?.message}
+                            {errors.degradationRate.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:265:41
                             type="number"
                             step="1"
                             defaultValue={DefaultVals.carryingCapacity}
-                            isInvalid={!!errors.carryingCapacity}
+                            isInvalid={!errors.carryingCapacity}
                             {...register("carryingCapacity", {
                                 valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:266:42
                             step="1"
                             defaultValue={DefaultVals.carryingCapacity}
                             isInvalid={!!errors.carryingCapacity}
-                            {...register("carryingCapacity", {
+                            {...register("", {
                                 valueAsNumber: true,
                                 required: "Carrying capacity is required",
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:267:48
                             defaultValue={DefaultVals.carryingCapacity}
                             isInvalid={!!errors.carryingCapacity}
                             {...register("carryingCapacity", {
-                                valueAsNumber: true,
+                                valueAsNumber: false,
                                 required: "Carrying capacity is required",
                                 min: {value: 1, message: "Carrying Capacity must be ≥ 1"},
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:275:30
                         </OverlayTrigger>
 
                         <Form.Control.Feedback type="invalid">
-                            {errors.carryingCapacity?.message}
+                            {errors.carryingCapacity.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:288:42
                             delay = '100'
                             >
                         <Form.Control
-                            data-testid={`${testid}-capacityPerUser`}
+                            data-testid={``}
                             id="capacityPerUser"
                             type="number"
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-capacityPerUser"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:292:43
                             id="capacityPerUser"
                             type="number"
                             step="1"
-                            defaultValue={defaultValuesData?.capacityPerUser}
+                            defaultValue={defaultValuesData.capacityPerUser}
                             isInvalid={!!errors.capacityPerUser}
                             {...register("capacityPerUser", {
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'capacityPerUser')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:293:40
                             type="number"
                             step="1"
                             defaultValue={defaultValuesData?.capacityPerUser}
-                            isInvalid={!!errors.capacityPerUser}
+                            isInvalid={!errors.capacityPerUser}
                             {...register("capacityPerUser", {
                                 valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:294:61
                             step="1"
                             defaultValue={defaultValuesData?.capacityPerUser}
                             isInvalid={!!errors.capacityPerUser}
-                            {...register("capacityPerUser", {
-                                valueAsNumber: true,
-                                required: "Capacity Per User is required",
-                            })}
+                            {...register("capacityPerUser", {})}
                         />
                         </OverlayTrigger>
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Capacity Per User is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:295:48
                             defaultValue={defaultValuesData?.capacityPerUser}
                             isInvalid={!!errors.capacityPerUser}
                             {...register("capacityPerUser", {
-                                valueAsNumber: true,
+                                valueAsNumber: false,
                                 required: "Capacity Per User is required",
                             })}
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:302:30
                         </OverlayTrigger>
 
                         <Form.Control.Feedback type="invalid">
-                            {errors.capacityPerUser?.message}
+                            {errors.capacityPerUser.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:309:61
             </Row>
 
             <Row>
-                <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r3`}>
+                <Form.Group className="mb-5" style={{width: "", height: '50px'}} data-testid={`${testid}-r3`}>
                     <Form.Label htmlFor="startingDate">Starting Date</Form.Label>
                     <Form.Control
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 300px;

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:316:37
                         id="startingDate"
                         type="date"
                         defaultValue={DefaultVals.startingDate}
-                        isInvalid={!!errors.startingDate}
+                        isInvalid={!errors.startingDate}
                         {...register("startingDate", {
                             valueAsDate: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:317:54
                         type="date"
                         defaultValue={DefaultVals.startingDate}
                         isInvalid={!!errors.startingDate}
-                        {...register("startingDate", {
-                            valueAsDate: true,
-                            validate: {isPresent: (v) => !isNaN(v)},
-                        })}
+                        {...register("startingDate", {})}
                     />
                     <Form.Control.Feedback type="invalid">
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:318:42
                         defaultValue={DefaultVals.startingDate}
                         isInvalid={!!errors.startingDate}
                         {...register("startingDate", {
-                            valueAsDate: true,
+                            valueAsDate: false,
                             validate: {isPresent: (v) => !isNaN(v)},
                         })}
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:319:58
                         isInvalid={!!errors.startingDate}
                         {...register("startingDate", {
                             valueAsDate: true,
-                            validate: {isPresent: (v) => !isNaN(v)},
+                            validate: {isPresent: (v) => isNaN(v)},
                         })}
                     />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ArrowFunction
main/components/Commons/CommonsForm.js:319:51
                         isInvalid={!!errors.startingDate}
                         {...register("startingDate", {
                             valueAsDate: true,
-                            validate: {isPresent: (v) => !isNaN(v)},
+                            validate: {isPresent: () => undefined},
                         })}
                     />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:323:26
                         })}
                     />
                     <Form.Control.Feedback type="invalid">
-                        {errors.startingDate?.message}
+                        {errors.startingDate.message}
                     </Form.Control.Feedback>
                 </Form.Group>
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:327:53
                     </Form.Control.Feedback>
                 </Form.Group>
                     
-                <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r4`}>
+                <Form.Group className="mb-5" style={{}} data-testid={`${testid}-r4`}>
                     <Form.Label htmlFor="lastDate">Last Date</Form.Label>
                     <Form.Control
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 300px;

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:330:38
                 <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r4`}>
                     <Form.Label htmlFor="lastDate">Last Date</Form.Label>
                     <Form.Control
-                        data-testid={`${testid}-lastDate`}
+                        data-testid={``}
                         id="lastDate"
                         type="date"
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-lastDate"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:334:37
                         id="lastDate"
                         type="date"
                         defaultValue={DefaultVals.lastDate}
-                        isInvalid={!!errors.lastDate}
+                        isInvalid={!errors.lastDate}
                         {...register("lastDate", {
                             valueAsDate: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:335:50
                         type="date"
                         defaultValue={DefaultVals.lastDate}
                         isInvalid={!!errors.lastDate}
-                        {...register("lastDate", {
-                            valueAsDate: true,
-                            validate: {isPresent: (v) => !isNaN(v)},
-                        })}
+                        {...register("lastDate", {})}
                     />
                     <Form.Control.Feedback type="invalid">
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:336:42
                         defaultValue={DefaultVals.lastDate}
                         isInvalid={!!errors.lastDate}
                         {...register("lastDate", {
-                            valueAsDate: true,
+                            valueAsDate: false,
                             validate: {isPresent: (v) => !isNaN(v)},
                         })}
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:341:26
                         })}
                     />
                     <Form.Control.Feedback type="invalid">
-                        {errors.lastDate?.message}
+                        {errors.lastDate.message}
                     </Form.Control.Feedback>
                 </Form.Group>
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:353:38
                 <Col md={6}>
                     <HealthUpdateStrategiesDropdown
                         formName={"aboveCapacityHealthUpdateStrategy"}
-                        displayName={"When above capacity"}
+                        displayName={""}
                         initialValue={aboveStrategy}
                         register={register}
killedBy: CommonsForm tests renders correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: /When above capacity/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:363:38
                 <Col md={6}>
                     <HealthUpdateStrategiesDropdown
                         formName={"belowCapacityHealthUpdateStrategy"}
-                        displayName={"When below capacity"}
+                        displayName={""}
                         initialValue={belowStrategy}
                         register={register}
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find a label with the text of: /When below capacity/

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:397:34
                     data-testid={`${testid}-showChat`}
                     type="checkbox"
                     id="showChat"
-                    {...register("showChat")}
+                    {...register("")}
                 />
                 </OverlayTrigger>
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:405:32
                 <Button type="submit"
                         data-testid="CommonsForm-Submit-Button"
                         className="pl-1 w-30 text-left"
-                        style={{width: '30%'}}
+                        style={{}}
                 >{buttonLabel}</Button>
             </Row>
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 30%;
