[Killed] ArrowFunction
src/main/pages/AdminCreateCommonsPage.js:11:33
 
 const AdminCreateCommonsPage = () => {
 
-    const objectToAxiosParams = (newCommons) => ({
-        url: "/api/commons/new",
-        method: "POST",
-        data: newCommons
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (commons) => {
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/AdminCreateCommonsPage.js:11:50
 
 const AdminCreateCommonsPage = () => {
 
-    const objectToAxiosParams = (newCommons) => ({
-        url: "/api/commons/new",
-        method: "POST",
-        data: newCommons
-    });
+    const objectToAxiosParams = (newCommons) => ({});
 
     const onSuccess = (commons) => {
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminCreateCommonsPage.js:17:36
         data: newCommons
     });
 
-    const onSuccess = (commons) => {
-        toast(<div>Commons successfully created!
-            <br />{`id: ${commons.id}`}
-            <br />{`name: ${commons.name}`}
-            <br />{`startDate: ${commons.startingDate}`}
-            <br />{`lastDate: ${commons.lastDate}`}
-            <br />{`cowPrice: ${commons.cowPrice}`}
-            <br />{`capacityPerUser: ${commons.capacityPerUser}`}
-            <br />{`carryingCapacity: ${commons.carryingCapacity}`}
-        </div>);
-    }
+    const onSuccess = (commons) => {}
    
     // Stryker disable all
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: <div>Commons successfully created!<br />id: 5<br />name: My New Commons<br />startDate: 2022-03-05T00:00:00<br />lastDate: 2023-03-05T00:00:00<br />cowPrice: 10<br />capacityPerUser: 10<br />carryingCapacity: 25</div>

Number of calls: 0

[Killed] StringLiteral
src/main/pages/AdminCreateCommonsPage.js:19:20
 
     const onSuccess = (commons) => {
         toast(<div>Commons successfully created!
-            <br />{`id: ${commons.id}`}
+            <br />{``}
             <br />{`name: ${commons.name}`}
             <br />{`startDate: ${commons.startingDate}`}
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

@@ -1,9 +1,9 @@
  <div>
    Commons successfully created!

[Killed] StringLiteral
src/main/pages/AdminCreateCommonsPage.js:20:20
     const onSuccess = (commons) => {
         toast(<div>Commons successfully created!
             <br />{`id: ${commons.id}`}
-            <br />{`name: ${commons.name}`}
+            <br />{``}
             <br />{`startDate: ${commons.startingDate}`}
             <br />{`lastDate: ${commons.lastDate}`}
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

@@ -1,11 +1,11 @@
  <div>
    Commons successfully created!

[Killed] StringLiteral
src/main/pages/AdminCreateCommonsPage.js:23:20
             <br />{`name: ${commons.name}`}
             <br />{`startDate: ${commons.startingDate}`}
             <br />{`lastDate: ${commons.lastDate}`}
-            <br />{`cowPrice: ${commons.cowPrice}`}
+            <br />{``}
             <br />{`capacityPerUser: ${commons.capacityPerUser}`}
             <br />{`carryingCapacity: ${commons.carryingCapacity}`}
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

@@ -7,11 +7,11 @@
    <br />
    startDate: 2022-03-05T00:00:00

[Killed] BlockStatement
src/main/pages/AdminCreateCommonsPage.js:38:42
     );
     // Stryker restore all
 
-    const submitAction = async (data) => {
-        mutation.mutate(data);
-    }
+    const submitAction = async (data) => {}
 
 
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
src/main/pages/AdminCreateCommonsPage.js:43:9
     }
 
 
-    if (mutation.isSuccess) {
+    if (true) {
         return <Navigate to="/" />
     }
killedBy: AdminCreateCommonsPage tests renders without crashing
statusReason: Error: Unable to find an element with the text: Create Commons. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div />
</body>

[Killed] ConditionalExpression
src/main/pages/AdminCreateCommonsPage.js:43:9
     }
 
 
-    if (mutation.isSuccess) {
+    if (false) {
         return <Navigate to="/" />
     }
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/"}

Number of calls: 0
