[Killed] BooleanLiteral
main/components/Commons/CommonsTable.js:12:48
 
 export default function CommonsTable({ commons, currentUser }) {
 
-    const [showModal, setShowModal] = useState(false);
+    const [showModal, setShowModal] = useState(true);
     const [cellToDelete, setCellToDelete] = useState(null);
 
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BlockStatement
main/components/Commons/CommonsTable.js:17:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/admin/editcommons/${cell.row.values["commons.id"]}`);
-    }
+    const editCallback = (cell) => {}
 
     const deleteMutation = useBackendMutation(
killedBy: AdminListCommonPage tests what happens when you click edit as an admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/editcommons/1"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Commons/CommonsTable.js:27:44
         ["/api/commons/allplus"]
     );
 
-    const deleteCallback = async (cell) => {
-        setCellToDelete(cell);
-        setShowModal(true);
-    }
+    const deleteCallback = async (cell) => {}
 
     const confirmDelete = async (cell) => {
killedBy: AdminListCommonPage tests what happens when you click delete, admin
statusReason: Error: Unable to find an element by: [data-testid="CommonsTable-Modal-Delete"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BooleanLiteral
main/components/Commons/CommonsTable.js:29:22
 
     const deleteCallback = async (cell) => {
         setCellToDelete(cell);
-        setShowModal(true);
+        setShowModal(false);
     }
 
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>

[Killed] BlockStatement
main/components/Commons/CommonsTable.js:32:43
         setShowModal(true);
     }
 
-    const confirmDelete = async (cell) => {
-        deleteMutation.mutate(cell);
-        setShowModal(false);
-    };
+    const confirmDelete = async (cell) => {};
 
     const leaderboardCallback = (cell) => {
killedBy: Modal tests Clicking Permanently Delete button deletes the commons
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Commons/CommonsTable.js:34:22
 
     const confirmDelete = async (cell) => {
         deleteMutation.mutate(cell);
-        setShowModal(false);
+        setShowModal(true);
     };
 
killedBy: Modal tests Clicking Permanently Delete button deletes the commons
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BlockStatement
main/components/Commons/CommonsTable.js:37:43
         setShowModal(false);
     };
 
-    const leaderboardCallback = (cell) => {
-        const route = `/leaderboard/${cell.row.values["commons.id"]}`
-        navigate(route)
-    }
+    const leaderboardCallback = (cell) => {}
 
     const columns = [
killedBy: AdminListCommonPage tests what happens when you click leaderboard as an admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/leaderboard/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:38:23
     };
 
     const leaderboardCallback = (cell) => {
-        const route = `/leaderboard/${cell.row.values["commons.id"]}`
+        const route = ``
         navigate(route)
     }
killedBy: AdminListCommonPage tests what happens when you click leaderboard as an admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/leaderboard/1"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:38:55
     };
 
     const leaderboardCallback = (cell) => {
-        const route = `/leaderboard/${cell.row.values["commons.id"]}`
+        const route = `/leaderboard/${cell.row.values[""]}`
         navigate(route)
     }
killedBy: AdminListCommonPage tests what happens when you click leaderboard as an admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/leaderboard/1"
Received: "/leaderboard/undefined"

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:45:23
     const columns = [
         {
             Header: 'id',
-            accessor: 'commons.id', // accessor is the "key" in the data
+            accessor: "", // accessor is the "key" in the data
 
         },
killedBy: AdminListCommonPage tests renders three commons without crashing for admin user
statusReason: Error: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-commons.id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:54:23
         },
         {
             Header: <span>Cow< br /> Price</span>,
-            accessor: row => row.commons.cowPrice,
+            accessor: () => undefined,
             id: 'commons.cowPrice'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:57:9
             accessor: row => row.commons.cowPrice,
             id: 'commons.cowPrice'
         },
-        {
-            Header:<span> Milk <br /> Price </span>,
-            accessor: row => row.commons.milkPrice,
-            id: 'commons.milkPrice' 
-        },
+        {},
         {
             Header:<span> Start <br /> Bal </span>,
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:59:23
         },
         {
             Header:<span> Milk <br /> Price </span>,
-            accessor: row => row.commons.milkPrice,
+            accessor: () => undefined,
             id: 'commons.milkPrice' 
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:64:23
         },
         {
             Header:<span> Start <br /> Bal </span>,
-            accessor: row => row.commons.startingBalance,
+            accessor: () => undefined,
             id: 'commons.startingBalance'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  10
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:67:9
             accessor: row => row.commons.startingBalance,
             id: 'commons.startingBalance'
         },
-        {
-            Header:<span> Starting <br /> Date </span>,
-            accessor: row => String(row.commons.startingDate).slice(0,10),
-            id: 'commons.startingDate'
-        },
+        {},
         {
             Header:<span> Last <br /> Date </span>,
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:69:23
         },
         {
             Header:<span> Starting <br /> Date </span>,
-            accessor: row => String(row.commons.startingDate).slice(0,10),
+            accessor: () => undefined,
             id: 'commons.startingDate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2022-11-22$/
Received:

[Killed] MethodExpression
main/components/Commons/CommonsTable.js:69:30
         },
         {
             Header:<span> Starting <br /> Date </span>,
-            accessor: row => String(row.commons.startingDate).slice(0,10),
+            accessor: row => String(row.commons.startingDate),
             id: 'commons.startingDate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2022-11-22$/
Received:
  2022-11-22T12:34:56

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:74:23
         },
         {
             Header:<span> Last <br /> Date </span>,
-            accessor: row => String(row.commons.lastDate).slice(0,10),
+            accessor: () => undefined,
             id: 'commons.lastDate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2022-11-22$/
Received:

[Killed] MethodExpression
main/components/Commons/CommonsTable.js:74:30
         },
         {
             Header:<span> Last <br /> Date </span>,
-            accessor: row => String(row.commons.lastDate).slice(0,10),
+            accessor: row => String(row.commons.lastDate),
             id: 'commons.lastDate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2022-11-22$/
Received:
  2022-11-22T12:34:56

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:79:23
         },
         {
             Header: <span> Degrad <br /> Rate </span>,
-            accessor: row => row.commons.degradationRate,
+            accessor: () => undefined,
             id: 'commons.degradationRate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  0.01
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:85:23
         {
             Header:<span> Show <br /> LrdrBrd? </span>,
             id: 'commons.showLeaderboard', // needed for tests
-            accessor: (row, _rowIndex) => String(row.commons.showLeaderboard) // hack needed for boolean values to show up
+            accessor: () => undefined // hack needed for boolean values to show up
         },
         {
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:87:9
             id: 'commons.showLeaderboard', // needed for tests
             accessor: (row, _rowIndex) => String(row.commons.showLeaderboard) // hack needed for boolean values to show up
         },
-        {
-            Header:<span> Show <br /> Chat? </span>,
-            id: 'commons.showChat', // needed for tests
-            accessor: (row, _rowIndex) => String(row.commons.showChat) // hack needed for boolean values to show up
-        },
+        {},
         {
             Header: <span> Tot <br /> Cows </span>,
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:90:23
         {
             Header:<span> Show <br /> Chat? </span>,
             id: 'commons.showChat', // needed for tests
-            accessor: (row, _rowIndex) => String(row.commons.showChat) // hack needed for boolean values to show up
+            accessor: () => undefined // hack needed for boolean values to show up
         },
         {
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  undefined
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:92:9
             id: 'commons.showChat', // needed for tests
             accessor: (row, _rowIndex) => String(row.commons.showChat) // hack needed for boolean values to show up
         },
-        {
-            Header: <span> Tot <br /> Cows </span>,
-            accessor: 'totalCows'
-        },
+        {},
         {
             Header: <span> Cap / <br /> User </span>,
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:94:23
         },
         {
             Header: <span> Tot <br /> Cows </span>,
-            accessor: 'totalCows'
+            accessor: ""
         },
         {
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:98:23
         },
         {
             Header: <span> Cap / <br /> User </span>,
-            accessor: row => row.commons.capacityPerUser,
+            accessor: () => undefined,
             id: 'commons.capacityPerUser'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  5
Received:

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:99:17
         {
             Header: <span> Cap / <br /> User </span>,
             accessor: row => row.commons.capacityPerUser,
-            id: 'commons.capacityPerUser'
+            id: ""
         },
         {
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:101:9
             accessor: row => row.commons.capacityPerUser,
             id: 'commons.capacityPerUser'
         },
-        {
-            Header: <span> Carry <br /> Cap </span>,
-            accessor: row => row.commons.carryingCapacity,
-            id: 'commons.carryingCapacity'
-        },
+        {},
         {
             Header: <span> Eff <br /> Cap </span>,
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:103:23
         },
         {
             Header: <span> Carry <br /> Cap </span>,
-            accessor: row => row.commons.carryingCapacity,
+            accessor: () => undefined,
             id: 'commons.carryingCapacity'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  42
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:106:9
             accessor: row => row.commons.carryingCapacity,
             id: 'commons.carryingCapacity'
         },
-        {
-            Header: <span> Eff <br /> Cap </span>,
-            accessor: 'effectiveCapacity'
-        }
+        {}
     ];
 
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:108:23
         },
         {
             Header: <span> Eff <br /> Cap </span>,
-            accessor: 'effectiveCapacity'
+            accessor: ""
         }
     ];
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:117:32
     const columnsIfAdmin = [
         ...columns,
         ButtonColumn("Edit", "primary", editCallback, testid),
-        ButtonColumn("Delete", "danger", deleteCallback, testid),
+        ButtonColumn("Delete", "", deleteCallback, testid),
         ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
         HrefButtonColumn("Stats CSV", "success", `/api/commonstats/download?commonsId=`, testid),
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:119:50
         ButtonColumn("Edit", "primary", editCallback, testid),
         ButtonColumn("Delete", "danger", deleteCallback, testid),
         ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
-        HrefButtonColumn("Stats CSV", "success", `/api/commonstats/download?commonsId=`, testid),
+        HrefButtonColumn("Stats CSV", "success", ``, testid),
     ];
 
killedBy: AdminListCommonPage tests correct href for stats csv button as an admin
statusReason: Error: expect(element).toHaveAttribute("href", "/api/commonstats/download?commonsId=1") // element.getAttribute("href") === "/api/commonstats/download?commonsId=1"

Expected the element to have attribute:
  href="/api/commonstats/download?commonsId=1"
Received:
  href="1"

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:119:39
         ButtonColumn("Edit", "primary", editCallback, testid),
         ButtonColumn("Delete", "danger", deleteCallback, testid),
         ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
-        HrefButtonColumn("Stats CSV", "success", `/api/commonstats/download?commonsId=`, testid),
+        HrefButtonColumn("Stats CSV", "", `/api/commonstats/download?commonsId=`, testid),
     ];
 
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-success")

Expected the element to have class:
  btn-success
Received:
  btn

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:122:50
         HrefButtonColumn("Stats CSV", "success", `/api/commonstats/download?commonsId=`, testid),
     ];
 
-    const columnsToDisplay = hasRole(currentUser,"ROLE_ADMIN") ? columnsIfAdmin : columns;
+    const columnsToDisplay = hasRole(currentUser,"") ? columnsIfAdmin : columns;
 
     const commonsModal = (
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: table; max-width: 100%; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:125:74
     const columnsToDisplay = hasRole(currentUser,"ROLE_ADMIN") ? columnsIfAdmin : columns;
 
     const commonsModal = (
-        <Modal data-testid="CommonsTable-Modal" show={showModal} onHide={() => setShowModal(false)}>
+        <Modal data-testid="CommonsTable-Modal" show={showModal} onHide={() => undefined}>
             <Modal.Header closeButton>
                 <Modal.Title>Confirm Deletion</Modal.Title>
killedBy: Modal tests Pressing the escape key on the modal cancels the deletion
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Commons/CommonsTable.js:125:93
     const columnsToDisplay = hasRole(currentUser,"ROLE_ADMIN") ? columnsIfAdmin : columns;
 
     const commonsModal = (
-        <Modal data-testid="CommonsTable-Modal" show={showModal} onHide={() => setShowModal(false)}>
+        <Modal data-testid="CommonsTable-Modal" show={showModal} onHide={() => setShowModal(true)}>
             <Modal.Header closeButton>
                 <Modal.Title>Confirm Deletion</Modal.Title>
killedBy: Modal tests Pressing the escape key on the modal cancels the deletion
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Commons/CommonsTable.js:133:113
                 Are you sure you want to delete this commons?            
             </Modal.Body>
             <Modal.Footer>
-                <Button variant="secondary" data-testid="CommonsTable-Modal-Cancel" onClick={() => setShowModal(false)}>
+                <Button variant="secondary" data-testid="CommonsTable-Modal-Cancel" onClick={() => setShowModal(true)}>
                     Keep this Commons
                 </Button>
killedBy: Modal tests Clicking Keep this Commons button cancels the deletion
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:133:94
                 Are you sure you want to delete this commons?            
             </Modal.Body>
             <Modal.Footer>
-                <Button variant="secondary" data-testid="CommonsTable-Modal-Cancel" onClick={() => setShowModal(false)}>
+                <Button variant="secondary" data-testid="CommonsTable-Modal-Cancel" onClick={() => undefined}>
                     Keep this Commons
                 </Button>
killedBy: Modal tests Clicking Keep this Commons button cancels the deletion
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:136:91
                 <Button variant="secondary" data-testid="CommonsTable-Modal-Cancel" onClick={() => setShowModal(false)}>
                     Keep this Commons
                 </Button>
-                <Button variant="danger" data-testid="CommonsTable-Modal-Delete" onClick={() => confirmDelete(cellToDelete)}>
+                <Button variant="danger" data-testid="CommonsTable-Modal-Delete" onClick={() => undefined}>
                     Permanently Delete
                 </Button>
killedBy: Modal tests Clicking Permanently Delete button deletes the commons
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] ConditionalExpression
main/components/Commons/CommonsTable.js:149:10
             columns={columnsToDisplay}
             testid={testid}
         />
-        {hasRole(currentUser,"ROLE_ADMIN") && commonsModal}
+        {false}
     </>);
 };
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>

[Killed] LogicalOperator
main/components/Commons/CommonsTable.js:149:10
             columns={columnsToDisplay}
             testid={testid}
         />
-        {hasRole(currentUser,"ROLE_ADMIN") && commonsModal}
+        {hasRole(currentUser, "ROLE_ADMIN") || commonsModal}
     </>);
 };
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>
