[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.js:34:14
 
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                    // Stryker disable next-line all
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
 
             <Form.Group className="mb-3" >
killedBy: AnnouncementForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="AnnouncementForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.js:34:14
 
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                    // Stryker disable next-line all
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
 
             <Form.Group className="mb-3" >
killedBy: AnnouncementForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="AnnouncementForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.js:63:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.start && 'Start is required (in ISO format).'}
+                    {true}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: Start is required (in ISO format).. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.js:63:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.start && 'Start is required (in ISO format).'}
+                    {errors.start || 'Start is required (in ISO format).'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
