[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.js:50:35
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "AnnouncementTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "AnnouncementTable"));
+        columns.push(ButtonColumn("", "danger", deleteCallback, "AnnouncementTable"));
     } 
 
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
