[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:317:54
                         type="date"
                         defaultValue={DefaultVals.startingDate}
                         isInvalid={!!errors.startingDate}
-                        {...register("startingDate", {
-                            valueAsDate: true,
-                            validate: {isPresent: (v) => !isNaN(v)},
-                            max: {value: curr.getTime(), message: "Cannot select future date."},
-                        })}
+                        {...register("startingDate", {})}
                     />
                     <Form.Control.Feedback type="invalid">
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:320:67
                         {...register("startingDate", {
                             valueAsDate: true,
                             validate: {isPresent: (v) => !isNaN(v)},
-                            max: {value: curr.getTime(), message: "Cannot select future date."},
+                            max: {value: curr.getTime(), message: ""},
                         })}
                     />
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: Cannot select future date.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
