[Timeout] StringLiteral
src/main/components/OurTable.js:19:60
 
 // Stryker restore all
 
-export default function OurTable({ columns, data, testid = "testid", pageSize = 5, ...rest }) {
+export default function OurTable({ columns, data, testid = "", pageSize = 5, ...rest }) {
   const [currentPage, setCurrentPage] = useState(1);
   const gonextPage = () => {

[Timeout] BlockStatement
src/main/components/OurTable.js:21:28
 
 export default function OurTable({ columns, data, testid = "testid", pageSize = 5, ...rest }) {
   const [currentPage, setCurrentPage] = useState(1);
-  const gonextPage = () => {
-    nextPage()
-    setCurrentPage(currentPage+1);
-  }
+  const gonextPage = () => {}
   const gopreviousPage = () => {
     previousPage()

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:23:20
   const [currentPage, setCurrentPage] = useState(1);
   const gonextPage = () => {
     nextPage()
-    setCurrentPage(currentPage+1);
+    setCurrentPage(currentPage - 1);
   }
   const gopreviousPage = () => {

[Timeout] BlockStatement
src/main/components/OurTable.js:25:32
     nextPage()
     setCurrentPage(currentPage+1);
   }
-  const gopreviousPage = () => {
-    previousPage()
-    setCurrentPage(currentPage-1);
-  }
+  const gopreviousPage = () => {}
   const gotoLastPage = (pageCount) => {
     gotoPage(pageCount)

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:27:20
   }
   const gopreviousPage = () => {
     previousPage()
-    setCurrentPage(currentPage-1);
+    setCurrentPage(currentPage + 1);
   }
   const gotoLastPage = (pageCount) => {

[Timeout] BlockStatement
src/main/components/OurTable.js:29:39
     previousPage()
     setCurrentPage(currentPage-1);
   }
-  const gotoLastPage = (pageCount) => {
-    gotoPage(pageCount)
-    setCurrentPage(pageCount+1);
-  }
+  const gotoLastPage = (pageCount) => {}
   const gotoFirstPage = () => {
     gotoPage(0)

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:31:20
   }
   const gotoLastPage = (pageCount) => {
     gotoPage(pageCount)
-    setCurrentPage(pageCount+1);
+    setCurrentPage(pageCount - 1);
   }
   const gotoFirstPage = () => {

[Killed] BlockStatement
src/main/components/OurTable.js:33:31
     gotoPage(pageCount)
     setCurrentPage(pageCount+1);
   }
-  const gotoFirstPage = () => {
-    gotoPage(0)
-    setCurrentPage(1)
-  }
+  const gotoFirstPage = () => {}
   const {
     getTableProps,
killedBy: OurTable tests first and last page buttons work with twentyRows
statusReason: TestingLibraryElementError: Unable to find an element with the text: react-table 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: blo

[Killed] ObjectLiteral
src/main/components/OurTable.js:50:16
     nextPage,
     previousPage,
     prepareRow,
-  } = useTable({
-    columns,
-    data,
-    initialState: { pageSize },
-    ...rest
-  }, useSortBy, usePagination)
+  } = useTable({}, useSortBy, usePagination)
 
   return (
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] StringLiteral
src/main/components/OurTable.js:72:27
                   <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
                     {column.isSorted
                       ? column.isSortedDesc
-                        ? ' 🔽'
+                        ? ""
                         : ' 🔼'
                       : ''}
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Error: Unable to find an element with the text: 🔽. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content;

[Timeout] BlockStatement
src/main/components/OurTable.js:82:28
           ))}
         </thead>
         <tbody {...getTableBodyProps()}>
-          {page.map(row => {
-            prepareRow(row)
-            return (
-              <tr {...row.getRowProps()}>
-                {row.cells.map((cell, _index) => (
-                  <td
-                    {...cell.getCellProps()}
-                    data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                  >
-                    {cell.render('Cell')}
-                  </td>
-                ))}
-              </tr>
-            )
-          })}
+          {page.map(row => {})}
         </tbody>
       </Table>

[Timeout] ArrowFunction
src/main/components/OurTable.js:86:32
             prepareRow(row)
             return (
               <tr {...row.getRowProps()}>
-                {row.cells.map((cell, _index) => (
-                  <td
-                    {...cell.getCellProps()}
-                    data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                  >
-                    {cell.render('Cell')}
-                  </td>
-                ))}
+                {row.cells.map(() => undefined)}
               </tr>
             )

[Timeout] StringLiteral
src/main/components/OurTable.js:91:34
                     {...cell.getCellProps()}
                     data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
                   >
-                    {cell.render('Cell')}
+                    {cell.render("")}
                   </td>
                 ))}

[Killed] ArrowFunction
src/main/components/OurTable.js:101:26
       </Table>
       {/* Pagination UI */}
       <div className="pagination">
-        <button onClick={() => gotoFirstPage()} disabled={!canPreviousPage}>
+        <button onClick={() => undefined} disabled={!canPreviousPage}>
           {'<<'}
         </button>
killedBy: OurTable tests first and last page buttons work with twentyRows
statusReason: TestingLibraryElementError: Unable to find an element with the text: react-table 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: blo

[Timeout] BooleanLiteral
src/main/components/OurTable.js:101:59
       </Table>
       {/* Pagination UI */}
       <div className="pagination">
-        <button onClick={() => gotoFirstPage()} disabled={!canPreviousPage}>
+        <button onClick={() => gotoFirstPage()} disabled={canPreviousPage}>
           {'<<'}
         </button>

[Timeout] ArrowFunction
src/main/components/OurTable.js:104:26
         <button onClick={() => gotoFirstPage()} disabled={!canPreviousPage}>
           {'<<'}
         </button>
-        <button onClick={() => gopreviousPage()} disabled={!canPreviousPage}>
+        <button onClick={() => undefined} disabled={!canPreviousPage}>
           {'<'}
         </button>

[Timeout] BooleanLiteral
src/main/components/OurTable.js:104:60
         <button onClick={() => gotoFirstPage()} disabled={!canPreviousPage}>
           {'<<'}
         </button>
-        <button onClick={() => gopreviousPage()} disabled={!canPreviousPage}>
+        <button onClick={() => gopreviousPage()} disabled={canPreviousPage}>
           {'<'}
         </button>

[Timeout] BooleanLiteral
src/main/components/OurTable.js:107:56
         <button onClick={() => gopreviousPage()} disabled={!canPreviousPage}>
           {'<'}
         </button>
-        <button onClick={() => gonextPage()} disabled={!canNextPage}>
+        <button onClick={() => gonextPage()} disabled={canNextPage}>
           {'>'}
         </button>

[Timeout] ArrowFunction
src/main/components/OurTable.js:107:26
         <button onClick={() => gopreviousPage()} disabled={!canPreviousPage}>
           {'<'}
         </button>
-        <button onClick={() => gonextPage()} disabled={!canNextPage}>
+        <button onClick={() => undefined} disabled={!canNextPage}>
           {'>'}
         </button>

[Timeout] StringLiteral
src/main/components/OurTable.js:108:12
           {'<'}
         </button>
         <button onClick={() => gonextPage()} disabled={!canNextPage}>
-          {'>'}
+          {""}
         </button>
         <button onClick={() => gotoLastPage(pageCount - 1)} disabled={!canNextPage}>

[Timeout] BooleanLiteral
src/main/components/OurTable.js:110:71
         <button onClick={() => gonextPage()} disabled={!canNextPage}>
           {'>'}
         </button>
-        <button onClick={() => gotoLastPage(pageCount - 1)} disabled={!canNextPage}>
+        <button onClick={() => gotoLastPage(pageCount - 1)} disabled={canNextPage}>
           {'>>'}
         </button>

[Timeout] ArrowFunction
src/main/components/OurTable.js:110:26
         <button onClick={() => gonextPage()} disabled={!canNextPage}>
           {'>'}
         </button>
-        <button onClick={() => gotoLastPage(pageCount - 1)} disabled={!canNextPage}>
+        <button onClick={() => undefined} disabled={!canNextPage}>
           {'>>'}
         </button>

[Timeout] StringLiteral
src/main/components/OurTable.js:111:12
           {'>'}
         </button>
         <button onClick={() => gotoLastPage(pageCount - 1)} disabled={!canNextPage}>
-          {'>>'}
+          {""}
         </button>
         <span>

[Killed] StringLiteral
src/main/components/OurTable.js:114:32
           {'>>'}
         </button>
         <span>
-          <strong data-testid={`testId-pagination`}>
+          <strong data-testid={``}>
             {currentPage} of {pageOptions.length}
           </strong>
killedBy: OurTable tests page index displays correctly for next and prev buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="testId-pagination"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Timeout] ObjectLiteral
src/main/components/OurTable.js:150:18
 // ];
 
 export function ButtonColumn(label, variant, callback, testid) {
-  const column = {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    )
-  }
+  const column = {}
   return column;
 }

[Timeout] BlockStatement
src/main/components/OurTable.js:166:64
   return column;
 }
 
-export function HrefButtonColumn(label, variant, href, testid) {
-  const column = {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        href={`${href}${cell.row.values["commons.id"]}`}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    )
-  }
-  return column;
-}
+export function HrefButtonColumn(label, variant, href, testid) {}
 
 export function PlaintextColumn(label, getText) {

[Timeout] ArrowFunction
src/main/components/OurTable.js:170:11
   const column = {
     Header: label,
     id: label,
-    Cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        href={`${href}${cell.row.values["commons.id"]}`}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    )
+    Cell: () => undefined
   }
   return column;

[Killed] ObjectLiteral
src/main/components/OurTable.js:184:18
 }
 
 export function PlaintextColumn(label, getText) {
-  const column = {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => (
-      <Plaintext text={getText(cell)} />
-    )
-  }
+  const column = {}
   return column;
 }
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Timeout] ObjectLiteral
src/main/components/OurTable.js:195:19
 }
 
 export function DateColumn(label, getDate) {
-  const options = {
-    year: 'numeric', month: 'numeric', day: 'numeric',
-    hour: 'numeric', minute: 'numeric', second: 'numeric',
-    hour12: false,
-    timeZone: 'America/Los_Angeles'
-  };
+  const options = {};
   const column = {
     Header: label,

[Killed] StringLiteral
src/main/components/OurTable.js:206:53
     id: label,
     Cell: ({ cell }) => {
       const date = new Date(getDate(cell));
-      const formattedDate = new Intl.DateTimeFormat('en-US', options).format(date);
+      const formattedDate = new Intl.DateTimeFormat("", options).format(date);
       return (<>{formattedDate}</>)
     }
killedBy: JobsTable tests Has the expected column headers and content
statusReason: RangeError: Incorrect locale information provided
