[Killed] StringLiteral
src/main/components/OurTable.js:68:38
                   data-testid={`${testid}-header-${column.id}`}
                 >
                   {column.render('Header')}
-                  <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
+                  <span data-testid={``}>
                     {column.isSorted
                       ? column.isSortedDesc
killedBy: JobsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="JobsTable-header-id-sort-carets"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: table; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Timeout] StringLiteral
src/main/components/OurTable.js:88:34
                 {row.cells.map((cell, _index) => (
                   <td
                     {...cell.getCellProps()}
-                    data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
+                    data-testid={``}
                   >
                     {cell.render('Cell')}

[Timeout] ArithmeticOperator
src/main/components/OurTable.js:109:45
         <button onClick={() => gonextPage()} disabled={!canNextPage}>
           {'>'}
         </button>
-        <button onClick={() => gotoLastPage(pageCount - 1)} disabled={!canNextPage}>
+        <button onClick={() => gotoLastPage(pageCount + 1)} disabled={!canNextPage}>
           {'>>'}
         </button>

[Timeout] ObjectLiteral
src/main/components/OurTable.js:166:18
 }
 
 export function HrefButtonColumn(label, variant, href, testid) {
-  const column = {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        href={`${href}${cell.row.values["commons.id"]}`}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    )
-  }
+  const column = {}
   return column;
 }

[Killed] StringLiteral
src/main/components/OurTable.js:172:15
     Cell: ({ cell }) => (
       <Button
         variant={variant}
-        href={`${href}${cell.row.values["commons.id"]}`}
+        href={``}
         data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
       >
killedBy: AdminListCommonPage tests correct href for stats csv button as an admin
statusReason: Error: expect(element).toHaveAttribute("href", "/api/commonstats/download?commonsId=1") // element.getAttribute("href") === "/api/commonstats/download?commonsId=1"

Expected the element to have attribute:
  href="/api/commonstats/download?commonsId=1"
Received:
  href=""

[Timeout] StringLiteral
src/main/components/OurTable.js:172:41
     Cell: ({ cell }) => (
       <Button
         variant={variant}
-        href={`${href}${cell.row.values["commons.id"]}`}
+        href={`${href}${cell.row.values[""]}`}
         data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
       >
